"""
1. 认识 Python
    - Python 是一种面向对象的解释型高级编程语言
    - Python 是强类型的动态脚本语言
    
    - （解释型语言）：使用专门的解释器对源码程序逐行解释成特定平台的机器并立即执行，
        是代码在执行时才被解释器一行行动态翻译和执行，而不是在执行之前就完成翻译
    - （对应 编译型语言，如C）：编译后就可以在平台运行，解释型语言在运行期间才编译；
        一般来说，编译型语言运行速度快；解释型语言跨平台特性更好
        
2. 编写第一个程序

3. Bug 和 Debug
    常见Bug
        - 输入错误 SyntaxError（非法字符）
        - 缩进错误 IndentationError
        - 命名错误 NameError
        - 。。。
    Debug
        - 断点调试
        
4. 注释
    - 单行注释
    - 多行注释

5. 快捷键

6. 输出函数 print
    参数
        - *values  输出多个值
        - sep  间隔多个对象，默认空格
        - end  以。。。结尾，默认 \n
"""